Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The *deployment module*, which is used during the augmentation phase of the build, describes how to "deploy" a library following the Quarkus philosophy. In other words, it applies all the Quarkus optimizations to your application during the build. The deployment module is also where we prepare things for GraalVM's native compilation.
ja_jp: ビルドのオーグメンテーションフェーズで使用される *デプロイメント モジュール* は、Quarkus の哲学に従ってライブラリーを「デプロイ」する方法を記述します。言い換えれば、ビルド中にアプリケーションにすべての Quarkus 最適化を適用します。デプロイメント モジュールは、GraalVM のネイティブコンパイルの準備を行う場所でもあります。

source: The *deployment*, *runtime* and *integration-test* directories containing the extension classes. See link:https://quarkus.io/guides/writing-extensions#create-new-extension-modules-using-maven[How to create new extension modules using Maven] for more details.
ja_jp: *デプロイメント* 、 *ランタイム* 、および *統合テスト* のディレクトリーがエクステンションクラスを含みます。詳細は「 https://quarkus.io/guides/writing-extensions#create-new-extension-modules-using-maven[Mavenを使って新しいエクステンションを作成する方法]」を参照してください。

source: The *dynamic* client, on the other hand, works rather like an equivalent of the JAX-RS client from the `javax.ws.rs.client` package. It does not require the domain classes to work, it works with abstract representations of GraphQL documents instead. Documents are built using a domain-specific language (DSL). The exchanged objects are treated as an abstract `JsonObject`, but, when necessary, it is possible to convert them to concrete model objects (if suitable model classes are available).
ja_jp: 一方、 *ダイナミック* ・クライアントは、 `javax.ws.rs.client` パッケージの JAX-RS クライアントに相当するものとして動作する。このクライアントは、ドメインクラスを必要とせず、代わりにGraphQLドキュメントの抽象的な表現を使って動作する。ドキュメントは、ドメイン固有の言語（DSL）を使って構築される。交換されたオブジェクトは、抽象的な `JsonObject` として扱われるが、必要に応じて、（適切なモデルクラスが利用可能であれば）具体的なモデルオブジェクトに変換することができる。

source: The *dynamic* client, on the other hand, works rather like an equivalent of the Jakarta REST client from the `jakarta.ws.rs.client` package. It does not require the domain classes to work, it works with abstract representations of GraphQL documents instead. Documents are built using a domain-specific language (DSL). The exchanged objects are treated as an abstract `JsonObject`, but, when necessary, it is possible to convert them to concrete model objects (if suitable model classes are available).
ja_jp: 一方、 *ダイナミック* クライアントは、 `jakarta.ws.rs.client` パッケージの Jakarta REST クライアントと同等に動作します。動作にドメイン クラスを必要とせず、代わりに GraphQL ドキュメントの抽象表現で動作します。ドキュメントは、ドメイン固有言語（DSL）を使用して構築されます。交換されたオブジェクトは抽象的な `JsonObject` として扱われますが、必要に応じて（適切なモデルクラスが利用可能な場合）具体的なモデルオブジェクトに変換することが可能です。

source: The *footer* at the bottom is primarily used to display logs while the application runs in dev mode.
ja_jp: 下部の *フッター* は、主にアプリケーションが開発モードで実行されている間のログを表示するために使用されます。

source: The *main panel* displays content for the selected menu item or extension. Depending on the selected page, it may render:
ja_jp: *メインパネル* は、選択されたメニュー項目またはエクステンションのコンテンツを表示します。選択されたページに応じて、以下をレンダリングする場合があります:

source: The *menu* on the left-hand side provides structured access to built-in pages:
ja_jp: 左側の *メニュー* は、組み込みページへの構造化されたアクセスを提供します。

source: The *runtime module* which represents the capabilities the extension developer exposes to the application's developer (an authentication filter, an enhanced data layer API, etc). Runtime dependencies are the ones the users will add as their application dependencies (in Maven POMs or Gradle build scripts).
ja_jp: エクステンション開発者がアプリケーション開発者に公開する機能を表す *ランタイムモジュール* (認証フィルター、強化されたデータ層 API など)。ランタイム依存関係は、ユーザーがアプリケーションの依存関係として追加するものです (Maven POM または Gradle ビルドスクリプト)。

source: The *typesafe* client works very much like the MicroProfile REST Client adjusted for calling GraphQL endpoints. A client instance is basically a proxy that you can call like a regular Java object, but under the hood, the call will be translated to a GraphQL operation. It works with domain classes directly. Any input and output objects for the operation will be translated to/from their representations in the GraphQL query language.
ja_jp: *typesafe* クライアントは、GraphQLエンドポイントを呼び出すために調整されたMicroProfile REST Clientと非常によく似た動作をします。クライアントのインスタンスは基本的にプロキシであり、通常のJavaオブジェクトのように呼び出すことができますが、中では呼び出しがGraphQL操作に変換されます。クライアントはドメインクラスと直接連携します。操作のための入出力オブジェクトは、GraphQLのクエリ言語での表現に変換されます。

source: The .env file
ja_jp: .envファイル

source: The 2 frameworks follow different semantic conventions. The OpenTelemetry Metrics are based on the https://opentelemetry.io/docs/concepts/semantic-conventions/[OpenTelemetry Semantic Conventions] and are still under active development (early 2025). Micrometer metrics convention format is around for a long time and has not changed much.
ja_jp: 2 つのフレームワークは、異なるセマンティック規則に従います。OpenTelemetry メトリクスは、https://opentelemetry.io/docs/concepts/semantic-conventions/[OpenTelemetry Semantic Conventions] に基づいており、現在も活発に開発中です (2025 年初頭)。Micrometer メトリクス規則の形式は長い間使用されており、あまり変更されていません。

source: The <<#docker,Docker extension>> is and has always been backwards-compatible with Podman because Podman exposes a https://podman.io/docs/installation[Docker-compatible API]. You can build container images with Podman using the Docker extension (see the https://quarkus.io/guides/podman[Using Podman with Quarkus guide]).
ja_jp: Podmanは link:https://podman.io/docs/installation[Docker互換のAPI] を公開しているため、 xref:docker[Docker拡張] 機能はPodmanと常に下位互換性があります。Dockerエクステンションを使用して、Podmanでコンテナイメージを構築できます（ link:https://quarkus.io/guides/podman[QuarkusでPodmanを使用するガイド] を参照してください）。

source: The <<mutual-tls>> mechanism has the highest priority when inclusive authentication is enabled, to ensure that an injected `SecurityIdentity` always represents <<mutual-tls>> and can be used to get access to `SecurityIdentity` identities provided by other authentication mechanisms.
ja_jp: 統合認証が有効になっている場合、<<mutual-tls>> メカニズムが最も優先され、注入された `SecurityIdentity` が常に <<mutual-tls>> を表し、他の認証メカニズムによって提供される `SecurityIdentity` アイデンティティーにアクセスするために使用できるようになります。

source: The <<openshift-client, OpenShift Client>> provides domain-specific language (DSL) accessors to common OpenShift resources. In addition, the extension supplies the necessary project configuration to bring in the OpenShift model type modules.
ja_jp: <<openshift-client, OpenShift クライアント>> は、一般的な OpenShift リソースへのドメイン固有言語 (DSL) アクセサーを提供します。さらに、このエクステンションは、OpenShift モデルタイプモジュールを取り込むために必要なプロジェクト設定を提供します。

source: The <<registry.quarkus.io,registry.quarkus.io>> is the default Quarkus community extension registry but it is not meant to be always the only registry. Other organizations may find it useful to create their own Quarkus extension registries to provide their own https://quarkus.io/guides/platform[Quarkus platforms] and/or individual (non-platform) Quarkus extensions. Users wishing to enable custom Quarkus extension registries in their environment would need to add them to the registry client configuration file.
ja_jp: <<registry.quarkus.io,registry.quarkus.io>> は、デフォルトのQuarkusコミュニティエクステンションレジストリですが、常に唯一のレジストリであることを意図しているわけではありません。他の組織は、独自の https://quarkus.io/guides/platform[Quarkusプラットフォーム]や個々の（非プラットフォーム）Quarkusエクステンションを提供するために、独自のQuarkusエクステンションレジストリを作成することが有用であると考えるかもしれません。自分の環境でカスタムQuarkusエクステンションレジストリを有効にすることを希望するユーザーは、レジストリクライアント設定ファイルに追加する必要があります。

source: The <<registry.quarkus.io,registry.quarkus.io>> is the default Quarkus community extension registry, but it is not meant to be always the only registry. Other organizations may find it useful to create their own Quarkus extension registries to provide their own https://quarkus.io/guides/platform[Quarkus platforms] and/or individual (non-platform) Quarkus extensions. Users wishing to enable custom Quarkus extension registries in their environment would need to add them to the registry client configuration file.
ja_jp: <<registry.quarkus.io,registry.quarkus.io>> は、デフォルトのQuarkusコミュニティエクステンションレジストリですが、常に唯一のレジストリであることを意図しているわけではありません。他の組織は、独自の https://quarkus.io/guides/platform[Quarkusプラットフォーム] や個々の（非プラットフォーム）Quarkusエクステンションを提供するために、独自のQuarkusエクステンションレジストリを作成することが有用であると考えるかもしれません。自分の環境でカスタムQuarkusエクステンションレジストリを有効にすることを希望するユーザーは、レジストリクライアント設定ファイルに追加する必要があります。

source: The <<registry.quarkus.io,registry.quarkus.io>> is the default Quarkus community extension registry, but it is not meant to be always the only registry. Other organizations may find it useful to create their own Quarkus extension registries to provide their own xref:platform.adoc[Quarkus platforms] and/or individual (non-platform) Quarkus extensions. Users wishing to enable custom Quarkus extension registries in their environment would need to add them to the registry client configuration file.
ja_jp: xref:registry.quarkus.io[registry.quarkus.io] はデフォルトのQuarkusコミュニティエクステンションレジストリですが、常に唯一のレジストリであることを意図しているわけではありません。他の組織が、独自のQuarkusエクステンションレジストリを作成し、独自の xref:platform.adoc[Quarkusプラットフォームや] 個別の（プラットフォーム以外の）Quarkusエクステンションを提供すると便利だと考えるかもしれません。自分の環境でカスタムのQuarkusエクステンションレジストリを有効にしたい場合は、レジストリのクライアント設定ファイルに追加する必要があります。

source: The <a href="https://groups.google.com/d/forum/quarkus-dev" target="_blank">quarkus-dev Google Groups</a>
ja_jp: <a href="https://groups.google.com/d/forum/quarkus-dev" target="_blank">quarkus-dev Google Groups</a>

source: The <code>@Incoming</code> and <code>@Outgoing</code> annotations are part of <a href="https://www.smallrye.io/smallrye-reactive-messaging">Reactive Messaging</a>. They are used to express from which <em>channel</em> you are consuming and to which <em>channel</em> you are sending. Thanks to Reactive Messaging you can consume and send messages from and to different brokers and transports such as HTTP, Kafka, or <a href="http://camel.apache.org">Apache Camel</a>.
ja_jp: <code>@Incoming</code>と<code>@Outgoing</code>のアノテーションは、<a href="https://www.smallrye.io/smallrye-reactive-messaging">Reactive Messaging</a>の一部です。これらは、どの<em>チャネル</em>から消費しているか、どの<em>チャネル</em>に送信しているかを表現するために使用されます。Reactive Messaging のおかげで、HTTP、Kafka、<a href="http://camel.apache.org">Apache Camel</a>など、さまざまなブローカーやトランスポートからメッセージを受信したり、それらに送信したりすることができます。

source: The <strong>Query Router</strong> is responsible for directing the query to multiple retrieval sources simultaneously. These sources include:
ja_jp: <strong>クエリルーティング</strong>は、クエリを複数の検索ソースに同時に指示する役割を担います。これらのソースには以下が含まれます:

source: The A2A Java SDK has seen significant improvements in type safety and **null-safety** through progressive adoption of JSpecify annotations over the past few months. This effort demonstrates the project's commitment to code quality and preventing null pointer exceptions at compile time.
ja_jp: A2A Java SDKは、過去数ヶ月にわたるJSpecifyアノテーションの段階的な採用を通じて、型安全性と **null安全** において大幅な改善がみられました。この取り組みは、コード品質に対するプロジェクトのコミットメントと、コンパイル時におけるNullPointerExceptionの防止を示しています。

source: The A2A Java SDK now includes built-in support for telemetry using OpenTelemetry. This allows you to monitor and trace your agent's operations, making it easier to diagnose issues and understand performance characteristics.
ja_jp: A2A Java SDK に、OpenTelemetry を使用したテレメトリーのサポートが組み込まれました。これにより、エージェントの操作を監視およびトレースできるようになり、問題の診断やパフォーマンス特性の把握が容易になります。

source: The A2A Protocol enables standardized communication between AI agents, allowing them to discover capabilities, delegate tasks, and collaborate seamlessly. This SDK provides a robust Java implementation for building both agents and clients that participate in the A2A ecosystem.
ja_jp: A2Aプロトコルは、AIエージェント間の標準化された通信を可能にし、エージェントが機能を検出し、タスクを委任し、シームレスに連携できるようにします。このSDKは、A2Aエコシステムに参加するエージェントとクライアントの両方を構築するための堅牢なJava実装を提供します。

source: The A2A specification itself is still evolving toward its 1.0 release. We're actively participating in the specification process and will continue aligning the SDK as the spec finalizes.
ja_jp: A2A 仕様自体も 1.0 リリースに向けて進化を続けています。私たちは仕様策定プロセスに積極的に参加しており、仕様が最終化されるにつれて SDK の調整を継続していきます。

source: The AMQP 0-9-1 protocol handshake timeout (ms) Type: _int_
ja_jp: AMQP 0-9-1 プロトコルハンドシェイクタイムアウト (ミリ秒) Type: _int_

source: The AMQP Dev Service will be enabled when the `quarkus-messaging-amqp` extension is present in your application, and the broker address has not been explicitly configured. More information can be found in the xref:amqp-dev-services.adoc[AMQP Dev Services Guide].
ja_jp: AMQP Dev Service は、 `quarkus-messaging-amqp` エクステンションがアプリケーションに存在し、ブローカのアドレスが明示的に設定されていない場合に有効になります。 詳細は xref:amqp-dev-services.adoc[AMQP Dev Services ガイド] を参照ください。

source: The AMQP Dev Service will be enabled when the `quarkus-smallrye-reactive-messaging-amqp` extension is present in your application, and the broker address has not been explicitly configured. More information can be found at the xref:amqp-dev-services.adoc[AMQP Dev Services Guide].
ja_jp: AMQP Dev Serviceは、アプリケーションに `quarkus-smallrye-reactive-messaging-amqp` エクステンションが存在し、ブローカー・アドレスが明示的に構成されていない場合に有効になります。詳細は、link:amqp-dev-services.html[AMQP Dev Services ガイド]を参照してください。

source: The AMQP Dev Service will be enabled when the `quarkus-smallrye-reactive-messaging-amqp` extension is present in your application, and the broker address has not been explicitly configured. More information can be found in the xref:amqp-dev-services.adoc[AMQP Dev Services Guide].
ja_jp: AMQP Dev Serviceは、アプリケーションに `quarkus-smallrye-reactive-messaging-amqp` エクステンションが存在し、ブローカー・アドレスが明示的に設定されていない場合に有効になります。詳細は、link:amqp-dev-services.html[AMQP Dev Services ガイド]を参照してください。

source: The AMQP address. If not set, the channel name is used Type: _string_
ja_jp: AMQP アドレス。設定されていない場合、チャネル名が使用されます タイプ: _string_

source: The AMQP connector allows Quarkus applications to send and receive messages using the AMQP 1.0 protocol. More details about the protocol can be found in http://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-overview-v1.0-os.html[the AMQP 1.0 specification]. It's important to note that AMQP 1.0 and AMQP 0.9.1 (implemented by RabbitMQ) are incompatible. Check <<using-rabbitmq,Using RabbitMQ>> to get more details.
ja_jp: AMQP コネクターを使用すると、Quarkus アプリケーションは AMQP1.0 プロトコルを使用してメッセージを送受信できます。プロトコルの詳細については、 http://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-overview-v1.0-os.html[the AMQP 1.0 specification を参照してください。AMQP 1.0 と AMQP 0.9.1 (RabbitMQ によって実装) には互換性がないことに注意することが重要です。詳細は、<<using-rabbitmq,Using RabbitMQ>> を参照してください。

source: The AMQP connector allows Quarkus applications to send and receive messages using the AMQP 1.0 protocol. More details about the protocol can be found in https://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-overview-v1.0-os.html[the AMQP 1.0 specification]. It's important to note that AMQP 1.0 and AMQP 0.9.1 (implemented by RabbitMQ) are incompatible. Check <<using-rabbitmq,Using RabbitMQ>> to get more details.
ja_jp: AMQP コネクターを使用すると、Quarkus アプリケーションは AMQP1.0 プロトコルを使用してメッセージを送受信できます。プロトコルの詳細については、 https://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-overview-v1.0-os.html[the AMQP 1.0 specification] を参照してください。AMQP 1.0 と AMQP 0.9.1 (RabbitMQ によって実装) には互換性がないことに注意することが重要です。詳細は、<<RabbitMQ の使用>> を参照してください。

source: The AMQP connector allows Quarkus applications to send and receive messages using the AMQP 1.0 protocol. More details about the protocol can be found in https://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-overview-v1.0-os.html[the AMQP 1.0 specification]. It's important to note that AMQP 1.0 and AMQP 0.9.1 (implemented by RabbitMQ) are incompatible. Check xref:using-rabbitmq[Using RabbitMQ] to get more details.
ja_jp: AMQPコネクターを使用すると、Quarkusアプリケーションは、AMQP 1.0プロトコルを使用してメッセージを送受信することができます。プロトコルの詳細については、 link:https://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-overview-v1.0-os.html[AMQP 1.0仕様] に記載されています。AMQP 1.0とAMQP 0.9.1（RabbitMQで実装）には互換性がないことに注意することが重要です。詳しくは xref:using-rabbitmq[RabbitMQの使用] をご覧ください。

source: The AMQP connector connects to AMQP 1.0 brokers such as Apache ActiveMQ or Artemis. To configure the location and credentials of the broker, add the following properties in the `application.properties`:
ja_jp: AMQP コネクターは、Apache ActiveMQ や Artemis などの AMQP 1.0 ブローカーに接続します。ブローカーの場所と資格情報を設定するには、 `application.properties` に次のプロパティーを追加します。

source: The AMQP connector connects to AMQP 1.0 brokers such as Apache's ActiveMQ Classic or ActiveMQ Artemis. To configure the location and credentials of the broker, add the following properties in the `application.properties`:
ja_jp: AMQP コネクターは、 Apache ActiveMQ Classic や ActiveMQ Artemis などの AMQP 1.0 ブローカーに接続します。ブローカーの場所とクレデンシャルを設定するには、 `application.properties` に以下のプロパティーを追加します。

source: The AMQP connector supports https://cloudevents.io/[Cloud Events]. The connector sends the outbound record as Cloud Events if:
ja_jp: AMQP コネクターは https://cloudevents.io/[Cloud Events] をサポートします。コネクターは、次の場合にアウトバウンドレコードをクラウドイベントとして送信します。

source: The AMQP connector supports https://cloudevents.io/[Cloud Events]. When the connector detects a _structured_ or _binary_ Cloud Events, it adds a `IncomingCloudEventMetadata<T>` into the metadata of the `Message`. `IncomingCloudEventMetadata` contains accessors to the mandatory and optional Cloud Event attributes.
ja_jp: AMQP コネクターは https://cloudevents.io/[Cloud Events] をサポートします。コネクターは、_structured_ または _binary_ Cloud Events を検出すると、 `IncomingCloudEventMetadata<T>` を `Message` のメタデータに追加します。 `IncomingCloudEventMetadata` は必須であり、オプションのクラウドイベントの属性へのアクセサを含みます。

source: The AMQP container id Type: _string_
ja_jp: AMQP コンテナー ID タイプ: _string_

source: The AMQP user name to use when connecting to the broker Type: _string_
ja_jp: ブローカーへの接続時に使用する AMQP ユーザー名。 Type: _string_

source: The AMQP username to use when connecting to the broker Type: _string_
ja_jp: ブローカーに接続するときに使用する AMQP ユーザー名 Type: _string_

source: The AOT cache file is `198 MB`, not surprising, given that the application contains 9,000 `.java` files.
ja_jp: AOT キャッシュファイルのサイズは `198 MB` ですが、アプリケーションに 9,000 個の `.java` ファイルが含まれていることを考えると、驚くにはあたりません。

source: The AOT cache file is `39 MB` in size, the minimum you can expect for a Quarkus REST application.
ja_jp: AOT キャッシュファイルのサイズは `39 MB` で、Quarkus REST アプリケーションで期待できる最小値です。

source: The AOT cache is **JDK version specific** - you must use the exact same JDK version at runtime as was used to generate the cache
ja_jp: AOT キャッシュは **JDK バージョン固有** です。実行時には、キャッシュの生成に使用されたものと全く同じ JDK バージョンを使用する必要があります。

source: The AOT cache is exactly that: a cache. If a class is not present in the cache, it is loaded and linked as usual.
ja_jp: AOT キャッシュはまさにその通り、キャッシュです。キャッシュにクラスが存在しない場合は、通常通りロードおよびリンクされます。

source: The AOT cache is only as good as the training data used to generate it. During the training phase, the JVM records which classes are loaded and linked, and collects method profiling data. The more representative the training workload, the more effective the resulting cache.
ja_jp: AOT キャッシュは、それを生成するために使用されるトレーニングデータの質に依存します。トレーニングフェーズ中、JVM はロードおよびリンクされたクラスを記録し、メソッドプロファイリングデータを収集します。トレーニングワークロードがより代表的であるほど、結果として得られるキャッシュはより効果的です。

source: The API is fluent so the builder initialization can be done as part of the fluent API sequence.
ja_jp: これは fluent API であるため、ビルダーの初期化は fluent API シーケンスの一部として実行できます。

source: The API is fluent so you can initialize the builder as part of a fluent sequence.
ja_jp: API は Fluent であるため、Fluent Sequence の一部としてビルダーを初期化できます。

source: The API is similar to the _imperative_ one except that the `send` method returns a `Uni<Void>`.
ja_jp: APIは、 `send` メソッドが `Uni<Void>` を返すことを除いて、 _命令型_ のものと似ています。

source: The AWS SAM CLI allows you to run your lambda's locally on your laptop in a simulated Lambda environment. This requires Docker to be installed. After you have built your Maven project, execute this command:
ja_jp: AWS SAM CLI を使用すると、ラップトップ上で Lambda をシミュレートした環境でローカルに実行することができます。このためには Docker をインストールする必要があります。Maven プロジェクトをビルドした後、以下のコマンドを実行してください

source: The Agent2Agent (A2A) Protocol is an open standard that enables AI agents to communicate and collaborate with one another, regardless of each agent's underlying framework, language, or vendor. The A2A Java SDK makes it easy to build A2A-compliant agents in Java, with reference implementations based on Quarkus.
ja_jp: Agent2Agent (A2A) プロトコルは、基盤となるフレームワーク、言語、ベンダーに関係なく、AI エージェント同士が通信し、連携できるようにするためのオープンスタンダードです。A2A Java SDK を使用すると、Quarkus ベースのリファレンス実装を使用して、A2A 準拠のエージェントを Java で簡単に構築できます。

source: The Agroal extension will take care of adjusting the JDBC URL with the `tracing` prefix when tracing is enabled, so you do not have to adjust the JDBC URL yourself.
ja_jp: トレースが有効な場合、JDBC の URL を `tracing` というプレフィックスで調整するのは Agroal エクステンションが担当するので、自分で JDBC の URL を調整する必要はありません。

source: The Amazon Services extensions got a new friend: a brand new Amazon IAM extension.
ja_jp: Amazon サービスのエクステンションに新しい友人ができました。真新しい Amazon IAM エクステンションです。

source: The Ansible collection for Quarkus does all the `heavy lifting` here. First, it checks out the code from Github and builds the application from its sources. It also ensures the system used for this step does have the required OpenJDK installed. By default, the application is built on the localhost (the Ansible controller), but it can be performed on a remote system if needed. Once the application is built, the collection will take care of the deployment.
ja_jp: Quarkus用のAnsibleコレクションは、 `大変な作業` はすべて実施してくれます。まず、Githubからコードをチェックアウトし、そのソースからアプリケーションをビルドします。また、このステップで使用するシステムに必要なOpenJDKがインストールされていることを確認します。デフォルトでは、アプリケーションはlocalhost（Ansibleコントローラー）上でビルドされますが、必要に応じてリモートシステム上で実行することもできます。アプリケーションがビルドされると、コレクションがデプロイを行います。

source: The Ansible collection we just installed only supports RHEL, Fedora, and other Linux distribution using RPMs. Ansible defines these as "RedHat family". Using the content on other platforms (Windows, Debian, Ubuntu, ...), while not impossible, will require a few adjustments.
ja_jp: 今インストールしたAnsibleコレクションは、RHEL、Fedora、その他のRPMを使ったLinuxディストリビューションのみをサポートしています。Ansibleはこれらを「RedHatファミリー」と定義しています。他のプラットフォーム（Windows、Debian、Ubuntu、...）でコンテンツを使用することは、不可能ではありませんが、いくつかの調整が必要です。

source: The Ansible collection we just installed only supports RHEL, Fedora, and other Linux distributions using RPMs. Ansible defines these as "RedHat family". Using the content on other platforms (Windows, Debian, Ubuntu, ...), while not impossible, will require a few adjustments.
ja_jp: 今インストールした Ansible コレクションは、RHEL、Fedora、その他 RPM を使用する Linux ディストリビューションのみをサポートしています。Ansible はこれらを「RedHat family」と定義しています。他のプラットフォーム（Windows、Debian、Ubuntu など）でコンテンツを使用することは不可能ではありませんが、いくつかの調整が必要です。

source: The Apache Kafka consumer uses an auto-commit approach by default. Applications using such a consumer are structured around a polling loop:
ja_jp: Apache Kafka のコンシューマーはデフォルトで自動コミットアプローチを使用しています。このようなコンシューマを使うアプリケーションはポーリングループを中心に構成されています:

source: The Apicurio Dev Service will be enabled when the `quarkus-apicurio-registry-avro` extension is present in your application, and it's address has not been explicitly configured. More information can be found at the xref:apicurio-registry-dev-services.adoc[Apicurio Registry Dev Services Guide].
ja_jp: Apicurio Dev Serviceは、アプリケーションに `quarkus-apicurio-registry-avro` エクステンションが存在し、そのアドレスが明示的に設定されていない場合に有効になります。詳細は、 link:apicurio-registry-dev-services.html[Apicurio Registry Dev Services Guide]を参照してください。

source: The Apicurio Dev Service will be enabled when the `quarkus-apicurio-registry-avro` extension is present in your application, and it's address has not been explicitly configured. More information can be found in the xref:apicurio-registry-dev-services.adoc[Apicurio Registry Dev Services Guide].
ja_jp: Apicurio Dev Serviceは、アプリケーションに `quarkus-apicurio-registry-avro` エクステンションが存在し、そのアドレスが明示的に設定されていない場合に有効になります。詳細は、 link:apicurio-registry-dev-services.html[Apicurio Registry Dev Services ガイド]を参照してください。

source: The Apicurio Dev Services supports xref:compose-dev-services.adoc[Compose Dev Services]. It relies on a `compose-devservices.yml`, such as:
ja_jp: Apicurio Dev Servicesは xref:compose-dev-services.adoc[Compose Dev Services] をサポートしています。 これは `compose-devservices.yml` に依存しています：
